{"\n": 0, " ": 1, "0": 2, "00": 3, "01": 4, "02": 5, "03": 6, "04": 7, "05": 8, "06": 9, "07": 10, "08": 11, "09": 12, "0A": 13, "0B": 14, "0C": 15, "0D": 16, "0E": 17, "0F": 18, "1": 19, "10": 20, "11": 21, "12": 22, "13": 23, "14": 24, "15": 25, "16": 26, "17": 27, "18": 28, "19": 29, "1A": 30, "1B": 31, "1C": 32, "1D": 33, "1E": 34, "1F": 35, "2": 36, "20": 37, "21": 38, "22": 39, "23": 40, "24": 41, "25": 42, "26": 43, "27": 44, "28": 45, "29": 46, "2A": 47, "2B": 48, "2C": 49, "2D": 50, "2F": 51, "3": 52, "30": 53, "31": 54, "32": 55, "33": 56, "34": 57, "35": 58, "36": 59, "37": 60, "38": 61, "39": 62, "3A": 63, "3B": 64, "3C": 65, "3D": 66, "3E": 67, "3F": 68, "4": 69, "40": 70, "41": 71, "42": 72, "43": 73, "44": 74, "45": 75, "46": 76, "47": 77, "48": 78, "49": 79, "4A": 80, "4B": 81, "4C": 82, "4D": 83, "4E": 84, "4F": 85, "5": 86, "50": 87, "51": 88, "52": 89, "53": 90, "54": 91, "55": 92, "56": 93, "57": 94, "58": 95, "59": 96, "5A": 97, "5B": 98, "5C": 99, "5D": 100, "5E": 101, "5F": 102, "6": 103, "60": 104, "61": 105, "62": 106, "63": 107, "64": 108, "65": 109, "66": 110, "67": 111, "68": 112, "69": 113, "6A": 114, "6B": 115, "6C": 116, "6D": 117, "6E": 118, "6F": 119, "7": 120, "70": 121, "71": 122, "72": 123, "73": 124, "74": 125, "75": 126, "76": 127, "77": 128, "78": 129, "79": 130, "7A": 131, "7B": 132, "7C": 133, "7D": 134, "7E": 135, "7F": 136, "8": 137, "80": 138, "81": 139, "82": 140, "83": 141, "84": 142, "85": 143, "86": 144, "87": 145, "88": 146, "89": 147, "8A": 148, "8B": 149, "8C": 150, "8D": 151, "8E": 152, "8F": 153, "9": 154, "90": 155, "91": 156, "92": 157, "93": 158, "94": 159, "95": 160, "96": 161, "97": 162, "98": 163, "99": 164, "9A": 165, "9E": 166, "9F": 167, ":": 168, "<BOS>": 169, "<EOS>": 170, "A": 171, "A0": 172, "A1": 173, "A2": 174, "A3": 175, "A4": 176, "A5": 177, "A6": 178, "A7": 179, "A8": 180, "A9": 181, "AA": 182, "AB": 183, "AC": 184, "AD": 185, "ADDRESS:": 186, "AE": 187, "AF": 188, "B": 189, "B0": 190, "B1": 191, "B2": 192, "B3": 193, "B4": 194, "B5": 195, "B6": 196, "B7": 197, "B8": 198, "B9": 199, "BA": 200, "BB": 201, "BC": 202, "BD": 203, "BE": 204, "BF": 205, "C": 206, "C0": 207, "C1": 208, "C2": 209, "C3": 210, "C4": 211, "C5": 212, "C6": 213, "C7": 214, "C8": 215, "CA": 216, "CB": 217, "CC": 218, "CD": 219, "CE": 220, "CF": 221, "D": 222, "D0": 223, "D1": 224, "D2": 225, "D3": 226, "D4": 227, "D5": 228, "D6": 229, "D7": 230, "D8": 231, "D9": 232, "DB": 233, "DD": 234, "DE": 235, "DF": 236, "E": 237, "E0": 238, "E1": 239, "E2": 240, "E4": 241, "E5": 242, "E6": 243, "E7": 244, "E8": 245, "E9": 246, "EA": 247, "EB": 248, "ED": 249, "EE": 250, "EF": 251, "F": 252, "F0": 253, "F1": 254, "F2": 255, "F3": 256, "F4": 257, "F5": 258, "F6": 259, "F7": 260, "F8": 261, "F9": 262, "FA": 263, "FB": 264, "FC": 265, "FD": 266, "FE": 267, "FF": 268, "I": 269, "K": 270, "N": 271, "P": 272, "PROTOCOL:": 273, "R": 274, "S": 275, "X": 276, "[BTN_0]": 277, "[BTN_1]": 278, "[BTN_2]": 279, "[BTN_3]": 280, "[BTN_4]": 281, "[BTN_5]": 282, "[BTN_6]": 283, "[BTN_7]": 284, "[BTN_8]": 285, "[BTN_9]": 286, "[BTN_BACK]": 287, "[BTN_CH_DOWN]": 288, "[BTN_CH_UP]": 289, "[BTN_ENTER]": 290, "[BTN_MENU]": 291, "[BTN_MUTE]": 292, "[BTN_POWER]": 293, "[BTN_VOL_DOWN]": 294, "[BTN_VOL_UP]": 295, "a": 296, "b": 297, "d": 298, "e": 299, "f": 300, "ff": 301, "g": 302, "i": 303, "k": 304, "m": 305, "n": 306, "o": 307, "r": 308, "s": 309, "t": 310, "u": 311, "x": 312, "y": 313}