{"\n": 0, " ": 1, "0": 2, "00": 3, "01": 4, "02": 5, "03": 6, "04": 7, "05": 8, "06": 9, "07": 10, "08": 11, "09": 12, "0A": 13, "0B": 14, "0C": 15, "0D": 16, "0E": 17, "0F": 18, "1": 19, "10": 20, "11": 21, "12": 22, "13": 23, "14": 24, "15": 25, "16": 26, "17": 27, "18": 28, "19": 29, "1A": 30, "1B": 31, "1C": 32, "1D": 33, "1E": 34, "1F": 35, "2": 36, "20": 37, "21": 38, "22": 39, "23": 40, "24": 41, "25": 42, "27": 43, "28": 44, "2A": 45, "2B": 46, "2C": 47, "2D": 48, "3": 49, "30": 50, "31": 51, "32": 52, "33": 53, "34": 54, "36": 55, "37": 56, "38": 57, "3A": 58, "3C": 59, "3E": 60, "3F": 61, "4": 62, "40": 63, "41": 64, "42": 65, "43": 66, "44": 67, "45": 68, "46": 69, "47": 70, "48": 71, "49": 72, "4A": 73, "4B": 74, "4C": 75, "4E": 76, "4F": 77, "5": 78, "50": 79, "51": 80, "52": 81, "53": 82, "54": 83, "55": 84, "57": 85, "58": 86, "59": 87, "5A": 88, "5B": 89, "5C": 90, "5D": 91, "5E": 92, "5F": 93, "6": 94, "60": 95, "61": 96, "63": 97, "64": 98, "65": 99, "66": 100, "67": 101, "68": 102, "69": 103, "6A": 104, "6B": 105, "6C": 106, "6D": 107, "6E": 108, "6F": 109, "7": 110, "70": 111, "71": 112, "72": 113, "73": 114, "74": 115, "75": 116, "76": 117, "77": 118, "78": 119, "79": 120, "7A": 121, "7B": 122, "7C": 123, "7D": 124, "7E": 125, "7F": 126, "8": 127, "80": 128, "81": 129, "82": 130, "83": 131, "84": 132, "85": 133, "86": 134, "87": 135, "88": 136, "89": 137, "8A": 138, "8B": 139, "8D": 140, "8E": 141, "8F": 142, "9": 143, "90": 144, "91": 145, "94": 146, "95": 147, "96": 148, "99": 149, "9A": 150, "9B": 151, "9D": 152, "9E": 153, "9F": 154, ":": 155, "<BOS>": 156, "<EOS>": 157, "A": 158, "A0": 159, "A1": 160, "A2": 161, "A3": 162, "A4": 163, "A5": 164, "A6": 165, "A8": 166, "AA": 167, "AC": 168, "AD": 169, "ADDRESS:": 170, "AF": 171, "B": 172, "B0": 173, "B1": 174, "B2": 175, "B3": 176, "B5": 177, "B6": 178, "B7": 179, "B8": 180, "B9": 181, "BA": 182, "BB": 183, "BC": 184, "BD": 185, "BE": 186, "BF": 187, "C": 188, "C0": 189, "C1": 190, "C2": 191, "C4": 192, "C5": 193, "C7": 194, "CA": 195, "CB": 196, "CC": 197, "CF": 198, "D": 199, "D1": 200, "D2": 201, "D3": 202, "D6": 203, "D8": 204, "D9": 205, "DC": 206, "DD": 207, "DE": 208, "DF": 209, "E": 210, "E0": 211, "E2": 212, "E3": 213, "E4": 214, "E6": 215, "E7": 216, "E9": 217, "EA": 218, "EB": 219, "ED": 220, "EE": 221, "EF": 222, "F": 223, "F0": 224, "F1": 225, "F2": 226, "F3": 227, "F4": 228, "F5": 229, "F7": 230, "F8": 231, "FA": 232, "FB": 233, "FC": 234, "FD": 235, "FE": 236, "FF": 237, "I": 238, "K": 239, "N": 240, "P": 241, "PROTOCOL:": 242, "R": 243, "S": 244, "X": 245, "[BTN_0]": 246, "[BTN_1]": 247, "[BTN_2]": 248, "[BTN_3]": 249, "[BTN_4]": 250, "[BTN_5]": 251, "[BTN_6]": 252, "[BTN_7]": 253, "[BTN_8]": 254, "[BTN_9]": 255, "[BTN_BACK]": 256, "[BTN_CH_DOWN]": 257, "[BTN_CH_UP]": 258, "[BTN_ENTER]": 259, "[BTN_MENU]": 260, "[BTN_MUTE]": 261, "[BTN_POWER]": 262, "[BTN_VOL_DOWN]": 263, "[BTN_VOL_UP]": 264, "a": 265, "e": 266, "g": 267, "i": 268, "k": 269, "m": 270, "n": 271, "o": 272, "r": 273, "s": 274, "t": 275, "u": 276, "x": 277, "y": 278}