{
  "0": 0,
  "00": 1,
  "01": 2,
  "02": 3,
  "03": 4,
  "04": 5,
  "05": 6,
  "06": 7,
  "07": 8,
  "08": 9,
  "09": 10,
  "0A": 11,
  "0B": 12,
  "0C": 13,
  "0D": 14,
  "0E": 15,
  "0F": 16,
  "1": 17,
  "10": 18,
  "11": 19,
  "12": 20,
  "13": 21,
  "14": 22,
  "15": 23,
  "16": 24,
  "17": 25,
  "18": 26,
  "19": 27,
  "1A": 28,
  "1B": 29,
  "1C": 30,
  "1D": 31,
  "1E": 32,
  "1F": 33,
  "2": 34,
  "20": 35,
  "21": 36,
  "22": 37,
  "23": 38,
  "24": 39,
  "25": 40,
  "26": 41,
  "27": 42,
  "28": 43,
  "29": 44,
  "2A": 45,
  "2B": 46,
  "2C": 47,
  "2D": 48,
  "2E": 49,
  "2F": 50,
  "3": 51,
  "30": 52,
  "31": 53,
  "32": 54,
  "33": 55,
  "34": 56,
  "35": 57,
  "36": 58,
  "37": 59,
  "38": 60,
  "39": 61,
  "3A": 62,
  "3B": 63,
  "3C": 64,
  "3D": 65,
  "3E": 66,
  "3F": 67,
  "4": 68,
  "40": 69,
  "41": 70,
  "42": 71,
  "43": 72,
  "44": 73,
  "45": 74,
  "46": 75,
  "47": 76,
  "48": 77,
  "49": 78,
  "4A": 79,
  "4B": 80,
  "4C": 81,
  "4D": 82,
  "4E": 83,
  "4F": 84,
  "5": 85,
  "50": 86,
  "51": 87,
  "52": 88,
  "53": 89,
  "54": 90,
  "55": 91,
  "56": 92,
  "57": 93,
  "58": 94,
  "59": 95,
  "5A": 96,
  "5B": 97,
  "5C": 98,
  "5D": 99,
  "5E": 100,
  "5F": 101,
  "6": 102,
  "60": 103,
  "61": 104,
  "62": 105,
  "63": 106,
  "64": 107,
  "65": 108,
  "66": 109,
  "67": 110,
  "68": 111,
  "69": 112,
  "6A": 113,
  "6B": 114,
  "6C": 115,
  "6D": 116,
  "6E": 117,
  "6F": 118,
  "7": 119,
  "70": 120,
  "71": 121,
  "72": 122,
  "73": 123,
  "74": 124,
  "75": 125,
  "76": 126,
  "77": 127,
  "78": 128,
  "79": 129,
  "7A": 130,
  "7B": 131,
  "7C": 132,
  "7D": 133,
  "7E": 134,
  "7F": 135,
  "8": 136,
  "80": 137,
  "81": 138,
  "82": 139,
  "83": 140,
  "84": 141,
  "85": 142,
  "86": 143,
  "87": 144,
  "88": 145,
  "89": 146,
  "8A": 147,
  "8B": 148,
  "8C": 149,
  "8D": 150,
  "8E": 151,
  "8F": 152,
  "9": 153,
  "90": 154,
  "91": 155,
  "92": 156,
  "93": 157,
  "94": 158,
  "95": 159,
  "96": 160,
  "97": 161,
  "98": 162,
  "99": 163,
  "9A": 164,
  "9B": 165,
  "9C": 166,
  "9D": 167,
  "9E": 168,
  "9F": 169,
  ":": 170,
  "<BOS>": 171,
  "<EOS>": 172,
  "A": 173,
  "A0": 174,
  "A1": 175,
  "A2": 176,
  "A3": 177,
  "A4": 178,
  "A5": 179,
  "A6": 180,
  "A7": 181,
  "A8": 182,
  "A9": 183,
  "AA": 184,
  "AB": 185,
  "AC": 186,
  "AD": 187,
  "ADDRESS:": 188,
  "AE": 189,
  "AF": 190,
  "B": 191,
  "B0": 192,
  "B1": 193,
  "B2": 194,
  "B3": 195,
  "B4": 196,
  "B5": 197,
  "B6": 198,
  "B7": 199,
  "B8": 200,
  "B9": 201,
  "BA": 202,
  "BB": 203,
  "BC": 204,
  "BD": 205,
  "BE": 206,
  "BF": 207,
  "C": 208,
  "C0": 209,
  "C1": 210,
  "C2": 211,
  "C3": 212,
  "C4": 213,
  "C5": 214,
  "C6": 215,
  "C7": 216,
  "C8": 217,
  "C9": 218,
  "CA": 219,
  "CB": 220,
  "CC": 221,
  "CD": 222,
  "CE": 223,
  "CF": 224,
  "D": 225,
  "D0": 226,
  "D1": 227,
  "D2": 228,
  "D3": 229,
  "D4": 230,
  "D5": 231,
  "D6": 232,
  "D7": 233,
  "D8": 234,
  "D9": 235,
  "DA": 236,
  "DB": 237,
  "DC": 238,
  "DD": 239,
  "DE": 240,
  "DF": 241,
  "E": 242,
  "E0": 243,
  "E1": 244,
  "E2": 245,
  "E3": 246,
  "E4": 247,
  "E5": 248,
  "E6": 249,
  "E7": 250,
  "E8": 251,
  "E9": 252,
  "EA": 253,
  "EB": 254,
  "EC": 255,
  "ED": 256,
  "EE": 257,
  "EF": 258,
  "F": 259,
  "F0": 260,
  "F1": 261,
  "F2": 262,
  "F3": 263,
  "F4": 264,
  "F5": 265,
  "F6": 266,
  "F7": 267,
  "F8": 268,
  "F9": 269,
  "FA": 270,
  "FB": 271,
  "FC": 272,
  "FD": 273,
  "FE": 274,
  "FF": 275,
  "I": 276,
  "K": 277,
  "N": 278,
  "P": 279,
  "PROTOCOL:": 280,
  "R": 281,
  "S": 282,
  "X": 283,
  "[BTN_0]": 284,
  "[BTN_1]": 285,
  "[BTN_2]": 286,
  "[BTN_3]": 287,
  "[BTN_4]": 288,
  "[BTN_5]": 289,
  "[BTN_6]": 290,
  "[BTN_7]": 291,
  "[BTN_8]": 292,
  "[BTN_9]": 293,
  "[BTN_AV]": 294,
  "[BTN_BACK]": 295,
  "[BTN_BLUE]": 296,
  "[BTN_CH_DOWN]": 297,
  "[BTN_CH_UP]": 298,
  "[BTN_DOWN]": 299,
  "[BTN_ENTER]": 300,
  "[BTN_EXIT]": 301,
  "[BTN_FAST_FORWARD]": 302,
  "[BTN_GREEN]": 303,
  "[BTN_HDMI]": 304,
  "[BTN_INFO]": 305,
  "[BTN_INPUT]": 306,
  "[BTN_LEFT]": 307,
  "[BTN_MENU]": 308,
  "[BTN_MUTE]": 309,
  "[BTN_NEXT]": 310,
  "[BTN_OK]": 311,
  "[BTN_PAUSE]": 312,
  "[BTN_PLAY]": 313,
  "[BTN_POWER]": 314,
  "[BTN_PREV]": 315,
  "[BTN_RED]": 316,
  "[BTN_REWIND]": 317,
  "[BTN_RIGHT]": 318,
  "[BTN_SELECT]": 319,
  "[BTN_SOURCE]": 320,
  "[BTN_STOP]": 321,
  "[BTN_UP]": 322,
  "[BTN_VOL_DOWN]": 323,
  "[BTN_VOL_UP]": 324,
  "[BTN_YELLOW]": 325,
  "a": 326,
  "b": 327,
  "d": 328,
  "e": 329,
  "f": 330,
  "g": 331,
  "i": 332,
  "k": 333,
  "m": 334,
  "n": 335,
  "o": 336,
  "r": 337,
  "s": 338,
  "t": 339,
  "u": 340,
  "x": 341,
  "y": 342
}